fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/CommonModules/ВКМ_АвтозаполнениеТЧДокументовСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ЗаполнитьУслугиПоДоговору(Документ, Договор) Экспорт
  
	//++Симбирёва О.С 20.06.26
	
	Документ.Товары.Очистить();
	Документ.Услуги.Очистить();
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) ИЛИ Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены настройки номенклатуры для автозаполнения (константы)");
		Возврат;
	КонецЕсли; 
	
	АбонентскаяПлата = Договор.ВКМ_АбонентскаяПлата;
	
	Если АбонентскаяПлата <> 0 Тогда
		СтрокаАбонентскаяПлата = Документ.Услуги.Добавить();
		СтрокаАбонентскаяПлата.Номенклатура = НоменклатураАбонентскаяПлата;
		СтрокаАбонентскаяПлата.Количество = 1;
		СтрокаАбонентскаяПлата.Цена = АбонентскаяПлата;
		СтрокаАбонентскаяПлата.Сумма = АбонентскаяПлата; 
	КонецЕсли;
	
	ДатаНачала = НачалоМесяца(Документ.Дата);
	ДатаОкончания = КонецМесяца(Документ.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплате
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&ДатаНачала, &ДатаОкончания,, Договор = &Договор) КАК
		|		ВКМ_ВыполненныеКлиентуРаботыОбороты";
	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("Договор", Договор); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

    Если Выборка.Следующий() Тогда

		СтрокаСуммаКоплате = Документ.Услуги.Добавить();
		СтрокаСуммаКоплате.Номенклатура = НоменклатураРаботыСпециалиста;
		СтрокаСуммаКоплате.Количество = 1;
		СтрокаСуммаКоплате.Цена = Выборка.СуммаКОплате;
		СтрокаСуммаКоплате.Сумма = СтрокаСуммаКоплате.Количество * СтрокаСуммаКоплате.Цена;
		
	КонецЕсли;
  
	//--Симбирёва О.С 20.06.26
	
КонецПроцедуры 

#КонецОбласти
